In [887]:
# Perform Encoding --> encoding is a way of converting text into numerical values.

In [888]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import plotly.express as px
import warnings

warnings.filterwarnings("ignore")

In [889]:
df = pd.read_csv("loan_prediction.csv")
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [890]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [891]:
# Now Object values convert into numerical values.
# Object values are --> Loan_ID, Gender, Married, Dependents, Education, 
#                       and Self_Employed, Property_Area, Loan_Status.

In [892]:
# For 1st Column --> Loan_ID
df['Loan_ID'].value_counts()

Loan_ID
LP001002    1
LP002328    1
LP002305    1
LP002308    1
LP002314    1
           ..
LP001692    1
LP001693    1
LP001698    1
LP001699    1
LP002990    1
Name: count, Length: 614, dtype: int64

In [893]:
df['Loan_ID']

0      LP001002
1      LP001003
2      LP001005
3      LP001006
4      LP001008
         ...
609    LP002978
610    LP002979
611    LP002983
612    LP002984
613    LP002990
Name: Loan_ID, Length: 614, dtype: object

In [894]:
Loan_ID = df['Loan_ID']
Loan_ID = (pd.get_dummies(Loan_ID, drop_first = True)).astype(int)
Loan_ID

,LP001003,LP001005,LP001006,LP001008,LP001011,LP001013,LP001014,LP001018,LP001020,LP001024,...,LP002959,LP002960,LP002961,LP002964,LP002974,LP002978,LP002979,LP002983,LP002984,LP002990
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0
610,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,1,0,0,0
611,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
612,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,1,0
613,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1

In [895]:
# For 2nd Column --> Gender
df['Gender'].value_counts

<bound method IndexOpsMixin.value_counts of 0        Male
1        Male
2        Male
3        Male
4        Male
        ...
609    Female
610      Male
611      Male
612      Male
613    Female
Name: Gender, Length: 614, dtype: object>

In [896]:
df['Gender']

0        Male
1        Male
2        Male
3        Male
4        Male
        ...
609    Female
610      Male
611      Male
612      Male
613    Female
Name: Gender, Length: 614, dtype: object

In [897]:
Gender = df['Gender']
Gender = (pd.get_dummies(Gender, drop_first = True)).astype(int)
Gender

     Male
0       1
1       1
2       1
3       1
4       1
..    ...
609     0
610     1
611     1
612     1
613     0

[614 rows x 1 columns]

In [898]:
# For 3rd Column --> Married
df['Married'].value_counts()

Married
Yes    398
No     213
Name: count, dtype: int64

In [899]:
df['Married']

0       No
1      Yes
2      Yes
3      Yes
4       No
      ...
609     No
610    Yes
611    Yes
612    Yes
613     No
Name: Married, Length: 614, dtype: object

In [900]:
Married = df['Married']
Married = (pd.get_dummies(Married, drop_first = True)).astype(int)
Married

     Yes
0      0
1      1
2      1
3      1
4      0
..   ...
609    0
610    1
611    1
612    1
613    0

[614 rows x 1 columns]

In [901]:
# For 4th Column --> Dependents
df['Dependents'].value_counts()

Dependents
0     345
1     102
2     101
3+     51
Name: count, dtype: int64

In [902]:
df['Dependents']

0       0
1       1
2       0
3       0
4       0
       ..
609     0
610    3+
611     1
612     2
613     0
Name: Dependents, Length: 614, dtype: object

In [903]:
Dependents = df['Dependents']
Dependents = (pd.get_dummies(Dependents, drop_first = True)).astype(int)
Dependents

     1  2  3+
0    0  0   0
1    1  0   0
2    0  0   0
3    0  0   0
4    0  0   0
..  .. ..  ..
609  0  0   0
610  0  0   1
611  1  0   0
612  0  1   0
613  0  0   0

[614 rows x 3 columns]

In [904]:
# For 5th Column --> Education
df['Education'].value_counts()

Education
Graduate        480
Not Graduate    134
Name: count, dtype: int64

In [905]:
df['Education']

0          Graduate
1          Graduate
2          Graduate
3      Not Graduate
4          Graduate
           ...
609        Graduate
610        Graduate
611        Graduate
612        Graduate
613        Graduate
Name: Education, Length: 614, dtype: object

In [906]:
Education = df['Education']
Education = (pd.get_dummies(Education, drop_first = True)).astype(int)
Education

     Not Graduate
0               0
1               0
2               0
3               1
4               0
..            ...
609             0
610             0
611             0
612             0
613             0

[614 rows x 1 columns]

In [907]:
# For 6th Column --> Self_Employed
df['Self_Employed'].value_counts()

Self_Employed
No     500
Yes     82
Name: count, dtype: int64

In [908]:
df['Self_Employed']

0       No
1       No
2      Yes
3       No
4       No
      ...
609     No
610     No
611     No
612     No
613    Yes
Name: Self_Employed, Length: 614, dtype: object

In [909]:
Self_Employed = df['Self_Employed']
Self_Employed = (pd.get_dummies(Self_Employed, drop_first=True)).astype(int)
Self_Employed

     Yes
0      0
1      0
2      1
3      0
4      0
..   ...
609    0
610    0
611    0
612    0
613    1

[614 rows x 1 columns]

In [910]:
# For 7th Column --> Property_Area
df['Property_Area'].value_counts()

Property_Area
Semiurban    233
Urban        202
Rural        179
Name: count, dtype: int64

In [911]:
df['Property_Area']

0          Urban
1          Rural
2          Urban
3          Urban
4          Urban
         ...
609        Rural
610        Rural
611        Urban
612        Urban
613    Semiurban
Name: Property_Area, Length: 614, dtype: object

In [912]:
Property_Area = df['Property_Area']
Property_Area = (pd.get_dummies(Property_Area, drop_first = True)).astype(int)
Property_Area

     Semiurban  Urban
0            0      1
1            0      0
2            0      1
3            0      1
4            0      1
..         ...    ...
609          0      0
610          0      0
611          0      1
612          0      1
613          1      0

[614 rows x 2 columns]

In [913]:
# For 8th Column --> Loan_Status
df['Loan_Status'].value_counts()

Loan_Status
Y    422
N    192
Name: count, dtype: int64

In [914]:
df['Loan_Status']

0      Y
1      N
2      Y
3      Y
4      Y
      ..
609    Y
610    Y
611    Y
612    Y
613    N
Name: Loan_Status, Length: 614, dtype: object

In [915]:
Loan_Status = df['Loan_Status']
Loan_Status = (pd.get_dummies(Loan_Status, drop_first=True)).astype(int)
Loan_Status

     Y
0    1
1    0
2    1
3    1
4    1
..  ..
609  1
610  1
611  1
612  1
613  0

[614 rows x 1 columns]

In [916]:
df1 = pd.concat([df, Loan_ID, Gender, Married, Dependents, Education, Self_Employed, Property_Area, Loan_Status], axis = 1)

In [917]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [918]:
df.drop(["Loan_ID", "Gender", "Married", "Dependents", "Education", "Self_Employed", "Property_Area", "Loan_Status"], axis = 1, inplace = True)

In [919]:
df.head()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
0,5849,0.0,NaN,360.0,1.0
1,4583,1508.0,128.0,360.0,1.0
2,3000,0.0,66.0,360.0,1.0
3,2583,2358.0,120.0,360.0,1.0
4,6000,0.0,141.0,360.0,1.0

In [920]:
# Again read file 
df2 = pd.read_csv("loan_prediction.csv")
df2.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [921]:
df2 = df2[["Loan_ID", "Gender", "Married", "Dependents", "Education", "Self_Employed", "Property_Area", "Loan_Status"]]

In [922]:
df2.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,Urban,Y
4,LP001008,Male,No,0,Graduate,No,Urban,Y

In [923]:
# using sklearn  -> For Encoding -- use first type of Encoding "OneHotEncoder".
from sklearn.preprocessing import OneHotEncoder

In [924]:
ohe = OneHotEncoder(drop = "first", sparse_output = False, dtype = np.int32)

In [925]:
df2 = ohe.fit_transform(df2) # Learn and convert

In [926]:
df2

array([[0, 0, 0, ..., 0, 1, 1],
       [1, 0, 0, ..., 0, 0, 0],
       [0, 1, 0, ..., 0, 1, 1],
       ...,
       [0, 0, 0, ..., 0, 1, 1],
       [0, 0, 0, ..., 0, 1, 1],
       [0, 0, 0, ..., 1, 0, 0]])

In [927]:
df3 = pd.DataFrame(df2)
df3.head()

,0,1,2,3,4,5,6,7,8,9,...,617,618,619,620,621,622,623,624,625,626
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,1,1
1,1,0,0,0,0,0,0,0,0,0,...,1,0,0,0,0,0,0,0,0,0
2,0,1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,1,0,0,1,1
3,0,0,1,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,1,1
4,0,0,0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,1,1

In [928]:
# Encoding is complete using first type ---> OneHotEncoder.

In [929]:
###################################################################################################
###################################################################################################
###################################################################################################
###################################################################################################
###################################################################################################
###################################################################################################

In [930]:
# Now Encoding perform using second type --> Ordinal Encoding.

In [931]:
ds = pd.read_csv("loan_prediction.csv")
ds.head(3)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y

In [932]:
ds.isnull().sum() # Checking missing values

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [933]:
ds["Gender"].value_counts()

Gender
Male      489
Female    112
Name: count, dtype: int64

In [934]:
ds["Married"].value_counts()

Married
Yes    398
No     213
Name: count, dtype: int64

In [935]:
ds["Dependents"].value_counts()

Dependents
0     345
1     102
2     101
3+     51
Name: count, dtype: int64

In [936]:
ds["Self_Employed"].value_counts()

Self_Employed
No     500
Yes     82
Name: count, dtype: int64

In [937]:
ds["LoanAmount"].value_counts()

LoanAmount
120.0    20
110.0    17
100.0    15
160.0    12
187.0    12
         ..
240.0     1
214.0     1
59.0      1
166.0     1
253.0     1
Name: count, Length: 203, dtype: int64

In [938]:
ds["Loan_Amount_Term"].value_counts()

Loan_Amount_Term
360.0    512
180.0     44
480.0     15
300.0     13
240.0      4
84.0       4
120.0      3
60.0       2
36.0       2
12.0       1
Name: count, dtype: int64

In [939]:
ds["Credit_History"].value_counts()

Credit_History
1.0    475
0.0     89
Name: count, dtype: int64

In [940]:
# Filling data in missing Values.
# Gender
ds.Gender.fillna(ds.Gender.mode()[0],inplace=True)

# Married
ds.Married.fillna(ds.Married.mode()[0],inplace=True)

# Dependents
ds.Dependents.fillna(ds.Dependents.mode()[0],inplace=True)

# Self_Employed
ds.Self_Employed.fillna(ds.Self_Employed.mode()[0],inplace=True)

# LoanAmount
ds.LoanAmount.fillna(ds.LoanAmount.median(),inplace=True)

# Loan_Amount_Term
ds.Loan_Amount_Term.fillna(ds.Loan_Amount_Term.median(), inplace=True)

# Credit_History
ds.Credit_History.fillna(ds.Credit_History.median(),inplace=True)

In [941]:
ds.isnull().sum()

Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

In [942]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             614 non-null    object
 2   Married            614 non-null    object
 3   Dependents         614 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      614 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         614 non-null    float64
 9   Loan_Amount_Term   614 non-null    float64
 10  Credit_History     614 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [943]:
# Object Columns name -->
# "Gender", "Married", "Education", "Self_Employed", "Property_Area ", "Loan_Status".

In [944]:
ds['Gender'].value_counts()

Gender
Male      502
Female    112
Name: count, dtype: int64

In [945]:
ds.head(3)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,128.0,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y

In [946]:
ds['Gender'] = ds['Gender'].map({"Male":0, "Female":1})
ds.head(10)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,0,No,0,Graduate,No,5849,0.0,128.0,360.0,1.0,Urban,Y
1,LP001003,0,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,0,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,0,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,0,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
5,LP001011,0,Yes,2,Graduate,Yes,5417,4196.0,267.0,360.0,1.0,Urban,Y
6,LP001013,0,Yes,0,Not Graduate,No,2333,1516.0,95.0,360.0,1.0,Urban,Y
7,LP001014,0,Yes,3+,Graduate,No,3036,2504.0,158.0,360.0,0.0,Semiurban,N
8,LP001018,0,Yes,2,Graduate,No,4006,1526.0,168.0,360.0,1.0,Urban,Y
9,LP001020,0,Yes,1,Graduate,No,12841,10968.0,349.0,360.0,1.0,Semiurban,N

In [947]:
ds['Married'].value_counts()

Married
Yes    401
No     213
Name: count, dtype: int64

In [948]:
ds['Married'] = ds['Married'].map({"Yes":0, "No":1})
ds.head(10)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,0,1,0,Graduate,No,5849,0.0,128.0,360.0,1.0,Urban,Y
1,LP001003,0,0,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,0,0,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,0,0,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,0,1,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
5,LP001011,0,0,2,Graduate,Yes,5417,4196.0,267.0,360.0,1.0,Urban,Y
6,LP001013,0,0,0,Not Graduate,No,2333,1516.0,95.0,360.0,1.0,Urban,Y
7,LP001014,0,0,3+,Graduate,No,3036,2504.0,158.0,360.0,0.0,Semiurban,N
8,LP001018,0,0,2,Graduate,No,4006,1526.0,168.0,360.0,1.0,Urban,Y
9,LP001020,0,0,1,Graduate,No,12841,10968.0,349.0,360.0,1.0,Semiurban,N

In [949]:
ds['Education'].value_counts()

Education
Graduate        480
Not Graduate    134
Name: count, dtype: int64

In [950]:
ds['Education'] = ds['Education'].map({"Graduate":0, "Not Graduate":1})
ds.head(10)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,0,1,0,0,No,5849,0.0,128.0,360.0,1.0,Urban,Y
1,LP001003,0,0,1,0,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,0,0,0,0,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,0,0,0,1,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,0,1,0,0,No,6000,0.0,141.0,360.0,1.0,Urban,Y
5,LP001011,0,0,2,0,Yes,5417,4196.0,267.0,360.0,1.0,Urban,Y
6,LP001013,0,0,0,1,No,2333,1516.0,95.0,360.0,1.0,Urban,Y
7,LP001014,0,0,3+,0,No,3036,2504.0,158.0,360.0,0.0,Semiurban,N
8,LP001018,0,0,2,0,No,4006,1526.0,168.0,360.0,1.0,Urban,Y
9,LP001020,0,0,1,0,No,12841,10968.0,349.0,360.0,1.0,Semiurban,N

In [951]:
ds['Self_Employed'].value_counts()

Self_Employed
No     532
Yes     82
Name: count, dtype: int64

In [952]:
ds['Self_Employed'] = ds['Self_Employed'].map({"No":0, "Yes":1})
ds.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,0,1,0,0,0,5849,0.0,128.0,360.0,1.0,Urban,Y
1,LP001003,0,0,1,0,0,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,0,0,0,0,1,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,0,0,0,1,0,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,0,1,0,0,0,6000,0.0,141.0,360.0,1.0,Urban,Y

In [953]:
ds['Property_Area'].value_counts()

Property_Area
Semiurban    233
Urban        202
Rural        179
Name: count, dtype: int64

In [954]:
ds['Property_Area'] = ds['Property_Area'].map({"Semiurban":0, "Urban":1, "Rural":2})
ds.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,0,1,0,0,0,5849,0.0,128.0,360.0,1.0,1,Y
1,LP001003,0,0,1,0,0,4583,1508.0,128.0,360.0,1.0,2,N
2,LP001005,0,0,0,0,1,3000,0.0,66.0,360.0,1.0,1,Y
3,LP001006,0,0,0,1,0,2583,2358.0,120.0,360.0,1.0,1,Y
4,LP001008,0,1,0,0,0,6000,0.0,141.0,360.0,1.0,1,Y

In [955]:
ds['Loan_Status'].value_counts()

Loan_Status
Y    422
N    192
Name: count, dtype: int64

In [956]:
ds['Loan_Status'] =  ds['Loan_Status'].map({"Y":0, "N":1})
ds.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,0,1,0,0,0,5849,0.0,128.0,360.0,1.0,1,0
1,LP001003,0,0,1,0,0,4583,1508.0,128.0,360.0,1.0,2,1
2,LP001005,0,0,0,0,1,3000,0.0,66.0,360.0,1.0,1,0
3,LP001006,0,0,0,1,0,2583,2358.0,120.0,360.0,1.0,1,0
4,LP001008,0,1,0,0,0,6000,0.0,141.0,360.0,1.0,1,0

In [957]:
ds.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,0,1,0,0,0,5849,0.0,128.0,360.0,1.0,1,0
1,LP001003,0,0,1,0,0,4583,1508.0,128.0,360.0,1.0,2,1
2,LP001005,0,0,0,0,1,3000,0.0,66.0,360.0,1.0,1,0
3,LP001006,0,0,0,1,0,2583,2358.0,120.0,360.0,1.0,1,0
4,LP001008,0,1,0,0,0,6000,0.0,141.0,360.0,1.0,1,0

In [958]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import OrdinalEncoder

In [959]:
ds1 = pd.read_csv("loan_prediction.csv")
ds1.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [960]:
ds2 = ds1[["Gender", "Married", "Education", "Self_Employed", "Property_Area", "Loan_Status"]]
ds2.head()

  Gender Married     Education Self_Employed Property_Area Loan_Status
0   Male      No      Graduate            No         Urban           Y
1   Male     Yes      Graduate            No         Rural           N
2   Male     Yes      Graduate           Yes         Urban           Y
3   Male     Yes  Not Graduate            No         Urban           Y
4   Male      No      Graduate            No         Urban           Y

In [963]:
oe = OrdinalEncoder(categories = [["Male", "Female"], ["Yes", "No"], ["Graduate", "Not Graduate"], ["No", "Yes"], ["Semiurban", "Urban", "Rural"], ["Y", "N"]])
ds3 = oe.fit_transform(ds2)
ds3

ValueError: Found unknown categories [nan] in column 0 during fit